In [1]:
import pandas as pd

In [2]:
df2 = pd.DataFrame ({
    'name': ['james','suresh','ramesh'],
    'maths':[76,67,82],
    'science':[86,72,69]
})

In [3]:
df2.stack()

0  name        james
   maths          76
   science        86
1  name       suresh
   maths          67
   science        72
2  name       ramesh
   maths          82
   science        69
dtype: object

In [4]:
df2.unstack()

name     0     james
         1    suresh
         2    ramesh
maths    0        76
         1        67
         2        82
science  0        86
         1        72
         2        69
dtype: object

In [5]:
import pandas as pd

df = pd.DataFrame({
    'name': ['ravi','ram','sita','gita'],
    'maths': [78, 88, 92, 85],
    'science': [82, 91, 89, 87]
})

df

   name  maths  science
0  ravi     78       82
1   ram     88       91
2  sita     92       89
3  gita     85       87

In [6]:
df2.melt(id_vars = 'name' , var_name = 'subject',value_name = 'marks')

     name  subject  marks
0   james    maths     76
1  suresh    maths     67
2  ramesh    maths     82
3   james  science     86
4  suresh  science     72
5  ramesh  science     69